{"Id":"343889","ProductId":"P1000-03","UserId":"A2XRRDO1V4AMEP","ProfileName":"Wok King","HelpfulnessNumerator":3,"HelpfulnessDenominator":4,"Score":4,"Time":"1237939200","Summary":"Taste, Flavor,Time, and Value","text":"Recently I've substituted steel cut oats for our cereal of choice after years of eating  rolled oats (both regular and quick cook). I've tried McCanns and Country Choice, and since there are many reviews already posted,  I'll slant mine based on Taste (mouth), Flavor (nose), Preparation, and Value.<br /><br />I rate Taste (nutty and chewy) and Flavor (pleasant aroma) a dead heat (5*). I also looked at the Nutrition Labels of McCanns, Country Choice, and Quaker's rolled oats, both regular and instant. List included calories, total fats, carbs, fiber, and protein and all were virtually identical from a nutritional standpoint<br /><br />Preparation. I've cooked all types of oatmeal via stove top but have not used the microwave. However, for the steel cut oats I also used a rice cooker, a Zojirushi model that had the capability for making porridge (this is the setting you want to use for steel cut oats),  and this  model had a timer that could be set in advance to finish cooking at a predetermined time. Although use of the rice cooker still requires a passage of time, actual cooking is automatic,  whereas using the stovetop required at least 25-30 minutes of simmering and close supervision to prevent scorching. (Of course, rolled oats takes less time.)<br /><br />Value: McCann's oats comes in a very attractive and elegant metal container (28 oz) and stresses the fact that it's Irish in origin whereas Country Choice comes in a cardboard container(30 oz) similar to the rolled oats type and boasts the fact that it is home grown (Minnesota) and is certified \"organic.\" It should be noted that McCann also packages its steel cut oats in a cardboard box (16 oz). If you make your purchase via Amazon (current prices) and disregard the shipping expense, the per ounce cost is: McCann's 28 oz container cost 20.6 cents, McCann's 16 oz container cost 19.13 cents, and Country Choice cost 11.27 cents.<br /><br />Since my personal evaluation finds both products even in Taste and Flavor, and both have similar cooking methodologies, my FIVE STAR choice is for the home grown, organic certified Country Choice which also a big budget saver.","Description":"Cinnamon Oats"}