{"Id":"240120","ProductId":"P1000-02","UserId":"A3D9NUCR4RXDPY","ProfileName":"Kathleen San Martino","HelpfulnessNumerator":2,"HelpfulnessDenominator":2,"Score":4,"Time":"1343260800","Summary":"My friend's 2 dogs and 5 shelter dogs ate this dog food eagerly","text":"Since my friend is into rescue work, I figured this dog food would be great to test on her two dogs and the five shelter dogs she is working with.  All the dogs ate this food eagerly and they were not starving dogs.  I also decided to do a taste test with two dog foods; this food and the <a href=\"http://www.amazon.com/gp/product/B002LANN56\">Chef Michael's Grilled Sirloin Dry Dog Food 4.5 Pound Bag</a> I was reviewing.  The one dog I tested it on sniffed both dog foods but chose to eat the Chef Michael's Grilled Sirloin Dry Dog Food  first.  However, he then finished off this food as well after devouring the other. So in the taste department I thinks it's pretty comparable.<br /><br />According to the packaging, PURINA Beneful Original Dog Food is 100% Complete and Balanced Nutrition with protein (beef), omega fatty acids and grains.  However, since I know dogs are carnivores I expected meat to be in at least one of the first four ingredients and they were not. The first four ingredients in order are ground yellow corn, chicken by-product meal, corn gluten meal, whole wheat flour.  Beef happens to be seventh in the ingredients list.<br /><br />Each serving contains:<br />Crude Protein 25%<br />Crude Fat 10%<br />Crude Fiber 4%<br />Moisture 14 %<br />Linoleic Acid 1.5%<br />Calcium 1.1 %<br />Iron 175 mg/kg<br />Selenium 0.2 mg/kg<br />Vitamin A 10,000 IU/kg<br />Vitamin E 100 IU/kg<br /><br />Overall, the dogs enjoyed this food.  However, even though the package states it meets 100% of their nutritional needs, based on the first four ingredients and the misleading protein (beef) statement on the packaging I was left wondering \"Where's the Beef?\"  For this reason I give the product four stars as I do not think this is a nutritional powerhouse.","Description":"Peanut Butter Crunch"}