{"Id":"240333","ProductId":"P1000-01","UserId":"A1YJMG0QJXZLD4","ProfileName":"Rosemarie","HelpfulnessNumerator":1,"HelpfulnessDenominator":2,"Score":2,"Time":"1343865600","Summary":"Not the best","text":"Ingredients: Ground yellow corn, chicken by-product meal, corn gluten meal, whole wheat flour, animal fat preserved with mixed-tocopherols (form of Vitamin E), rice flour, beef, soy flour, sugar, propylene glycol, meat and bone meal, tricalcium phosphate, phosphoric acid, salt, water, animal digest, sorbic acid (a preservative), potassium chloride, dried carrots, dried peas, calcium propionate (a preservative), L-Lysine monohydrochloride, choline chloride, added color (Red 40, Yellow 5, Yellow 6, Blue 2), DL-Methionine, Vitamin E supplement, zinc sulfate, ferrous sulfate, manganese sulfate, niacin, Vitamin A supplement, calcium carbonate, copper sulfate, Vitamin B-12 supplement, calcium pantothenate, thiamine mononitrate, garlic oil, pyridoxine hydrochloride, riboflavin supplement, Vitamin D-3 supplement, menadione sodium bisulfite complex (source of Vitamin K activity), calcium iodate, folic acid, biotin, sodium selenite.Fiber (estimated dry matter content) = 4.7%<br /><br />The first ingredient in this dog food is corn. Corn is an inexpensive and controversial cereal grain of only modest nutritional value to a dog.<br /><br />For this reason, we do not consider corn a preferred component in any dog food.<br /><br />The second item is chicken by-product meal, a dry rendered product of slaughterhouse waste. It's made from what's left of a slaughtered chicken after all the prime cuts have been removed.<br /><br />In a nutshell, chicken by-products are those unsavory leftovers usually considered \"unfit for human consumption\".<br /><br />In addition to organs (the nourishing part), this stuff can contain almost anything -- feet, beaks, undeveloped eggs -- anything except quality skeletal muscle (real meat).<br /><br />I have seen enough:<br /><br />This is according to the Dog Food Advisor.<br />This is just a samll part of their review that can be found on the web just Google \"review for Beneful\".<br /><br />I am no expert so I felt the need to quote someone who is.  We love our dogs and they deserve the best food available. Personally I use only raw for my dog but thought he might like a change so I tried a few different kinds.  This is not as bad as some so I will use it for training since it is hard and not to greasy and I do not feed my dog large amounts.<br /><br />My dog does seem to like it but it is not going to be part of his mealtime.  Something I noticed on the label is a reference to feeding our dogs once a day, may I caution you, I used to feed my dog once a day until I found out that, that causes bloat.  Bloat is a very painful condition that only some dogs get when they seem to eat too fast, this is also due to the one a day feeding they seem not to be able to get enough. Please feed your dog twice per day.<br /><br />I do not feel this is a very good food for your dog.  Dogs are generally not made to deal with so much grain they are carnivores and do much better on a diet almost completely meat and bones. According to Peta some of these dry foods are the remains of dead and sick animals as eluded to in the later review.  I will stick to the diet I put my boy on.  I suggest you keep looking for something better.<br /><br />I am sure some of us do not eat the best food all the time and sometimes will eat bacon and eggs and a twinkie now and again and that is fine and it will not kill us and this food, on ocassion, will not kill our dogs but please do not feed them a food like this on a regular diet.<br /><br />We have our dogs for such a short time why not feed them quality food to keep them around longer."}