{"Id":"36429","ProductId":"P1000-04","UserId":"A2J8MDDO8X59NO","ProfileName":"Judilyn","HelpfulnessNumerator":1,"HelpfulnessDenominator":1,"Score":5,"Time":"1322265600","Summary":"Don't expect pasta!","text":"I am so happy to have found Miracle Noodle here, introducing me to the Shirataki noodle!<br /><br />If you are expecting it to taste or have the texture of pasta, you may be disappointed.  However, I love it!  I eat a lot Asian food so I was able to accept the initial smell and unique texture.  The \"fishy\" smell rises out.  It wasn't strong smelling when i opened it up, but because I read the past reviews I had to give it a good sniff to see what they were complaining about.  And yes, it was not a very appetizing smell, but it went away after rising it for about 30 seconds.  I ate my first serving of Miracle Noodle with a Japanese noodle soup base (used for tempura sauce, somen, udon, etc.) and it worked perfectly.  I was positively giddy.  Zero calories!  I actually love the texture.  It's a little rubbery but not chewy.  I don't know what it can be compared to in our common American cuisine, but it is made from a vegetable, so expect a more vegetable-like texture. Like another reviewer stated, it is similar to Asian glass noodles.<br /><br />Now for the big test: Let my husband try it.<br />New foods often ignite dialogue like,<br />\"Eww, I hate X.\"<br />\"You've never tried X.\"<br />\"Yeah cuz I don't like it.\"<br />LOL. He has, however, become more adventurous with new foods and seeing me dance around singing \"zero calories\" tempted him enough. I gave him a bite and he just kind of responded with \"meh\".  I didn't expect much, so I count that as a success in my book! With the right ingredients and maybe some hot sauce, I'm sure he'd like it just fine.<br /><br />I am excited to try different methods of preparing this noodle.  It seems like the perfect filler food in place of rice or pasta.  MUCH healthier.  It really does just take on the flavor of what it's prepared with.  I was able to find individual packages a shirataki noodles (different brands) in my local Asian food market (next to produce) at a lower price, however I have not tried it yet.  It looks exactly the same and I can't imagine it'd be much different.  So if you're hesitant about buying a 6-pack, maybe you could try that first.<br /><br />I am so glad Miracle Noodle has marketed this product in this way to help get this out to more people.  I would have never thought something like this existed.  This has become one of my new staples.  Bye-bye high calorie noodles!"}