{"Id":"240328","ProductId":"P1000-01","UserId":"A3V15SFD7918WZ","ProfileName":"Jesse D. Walker","HelpfulnessNumerator":1,"HelpfulnessDenominator":2,"Score":3,"Time":"1344988800","Summary":"This isn't good dog food. Here are rules for finding one:","text":"If you know anything about canine nutrition, or care enough about your pet to want to feed them something that's good for them, you won't pick this food. Yes, it's better than Wallyworld's Old Roy (which fails my two tests below much worse than this does), but it's far from great. Here's why:<br /><br />Like all other crappy dog foods (95% of what's on the shelf at the store), corn is a major ingredient of this dog food (#1 on the ingredients list! Couldn't be worse). Dogs do not digest corn well. It makes for terrible dog food. And the meat that's included is of the \"by-product\" variety. So, it's ground chicken bones and toenails, not muscle tissue (\"meat\"). So why are these things in there? They're cheap. Filler. That's it.<br /><br />Here are my own personal rules for selecting a good dog food:<br /><br />1. If the word \"corn\" appears ANYWHERE in the ingredients, I pass. It's not good for the dog. Other grains are more okay: rice (preferably brown, not brewers), etc. A few non-corn grains are fine, but you don't want your pet eating mostly grains. While omnivorous (most fruits and veggies are great), dogs are Carnivores.<br /><br />2. Meat must be high on the ingredients list, preferably in the #1 position (\"meal\" is okay; just means dried meat. \"By-products\" are not okay).<br /><br />Those two rules pretty much guarantee you'll weed out the junk. And yes, Science Diet is junk, despite what your vet told you.<br /><br />3. My $ rule: $1 a pound or less, because I'm frugal. This is about the price point where great dog foods are obtainable (that doesn't mean all expensive dog foods are good; in fact, all of the big brands (purina, iams, eukanuba, science diet, etc) are all well-marketed, overpriced junk). The only major exception to the \"good food usually costs more\" rule that I've noticed is Costco's dog food, which is actually pretty good, and only about 25 bucks for a 40 pound bag. Best deal in canine nutrition, I think.<br /><br />Where'd I get my info? A lot of research. Start with a google search for the Whole Dog Journal's annual review of dog foods. It's the most authoritative thing out there.  Additionally, my wife is a dog trainer (the Best Friends type, not the Cesar Milan type; corn is to dog food what the \"dog whisperer\" is to dog training: junk) and works at our local humane society, where they get to test a LOT of donated foods.<br /><br />Oh yeah, and I teach the Mammalogy course at our local university. I understand mammalian anatomy and digestion.<br /><br />If you care about your pet, do your homework, people. And please don't use the \"but my dog likes this brand\" test. I love ice cream, and would eat it at every meal if I could, but my wife tells me it's not good for me. Cheap dog foods are loaded with grease to make dogs want it. Doesn't make it healthy."}