{"Id":"367634","ProductId":"P1000-05","UserId":"A3MLOUYSAIGOFY","ProfileName":"S. Borden \"flight risk\"","HelpfulnessNumerator":150,"HelpfulnessDenominator":163,"Score":5,"Time":"1256774400","Summary":"BEST OIL FOR BAKING, FRYING, SKIN SOFTENER, OR RIGHT OUT OF THE JAR","text":"After menopause, I developed high total cholesterol.  Fortunately, only the \"lousy\" cholesterol (LDH) increased, with my \"happy\" number (HDL) staying at an impressive 90.  Instead of taking the recommended \"liptor, et al\", and as a registered nurse who knows the awful side effects of such drugs, I opted to research all things diet related.  After my studies, I have decided that our government and medical community has been either ignorant, at best, or complicit, at worst, in the great soybean growers maligning of the health benefits of this oil.  There are a few good scientific books available through Amazon.  I'm not due for another lipid test for at least a year.  I will post an update here, good or bad outcome.<br /><br />Whole Foods stopped carrying this brand.  I tried their new 365 brand and had to spit it out --- TOTAL PLASTIC TASTE AND SMELL.  This product is in a non-leaching plastic container and is incredibly pleasant tasting raw (only do that after eating anything sweetened with sugar or honey to prevent cavities), but unbelievably delicious in cooking.  Last week I was in an interview and the lady turned and smiled stating she detected a \"slight, delightful hint of just-baked cookies\" coming from my direction.  HAD TO BE THIS OIL I always pop a little in my mouth before going out!!!!!<br /><br />Watch the medical statistics that will be coming out of the country of Jamaica in the next two to three years.  The soybean inudstry has recently purchased all the coconut fields, torn down the trees, and planted soybeans!!!!!  If the studies I am trusting in are correct, they will begin developing a high incidence of heart disease and strokes, almost unknown to them up until now!!!!!"}