{"Id":"367628","ProductId":"P1000-05","UserId":"A2SA6LR78V49UV","ProfileName":"OrangeCrush \"Still shooting with Film!\"","HelpfulnessNumerator":58,"HelpfulnessDenominator":58,"Score":5,"Time":"1319673600","Summary":"Amazing Stuff!","text":"We initially purchased Coconut Oil for dietary reasons. My wife and I had both read multiple books and articles that stated how healthy Coconut oil is and we are constantly looking for ways to improve our diets. We have since incorporated it into many aspects of our diets. In particular, its amazing with some of the juicing recipes we have come up with. I also enjoy cooking with it, but only with certain meals. Its important to note that cooking oils at high temperatures really cuts down on the nutritional content. So we always cook at lower temperatures when using Coconut or Olive oil. Anyways, we have come to love Coconut oil and it now has a permanent spot in our food pantry.<br /><br />We also started making homemade soap a few years back and while we didn't use coconut oil originally, we figured we would try it since we already had jars of it sitting on our shelves. Well, to make a long story short, its now incorporated in every single one of our recipes. In fact, my favorite soap is actually a recipe that focuses specifically on the coconut oil.<br /><br />Lastly, my wife one upped the soap making and started making homemade shampoo and conditioners and to say that they are amazing is a massive understatement. In particular, the conditioner she makes is unbelievable. I dont know the recipes but I do know that coconut oil is one of the major ingredients that she uses. My hair has never been softer and neither has hers. On top of that the smell is absolutely hypnotic.<br /><br />Bottom line - 12 months ago Coconut oil had absolutely no place in our home. Fast forward to today and....well, it now plays an major role in our lives, both for dietary and hygienic purposes. Even if you dont make homemade soaps, the health benefits alone should be more than enough for you to incorporate Coconut oil into your diet. Its one of the healthiest oils out there.<br /><br />Highly Recommended."}