{"Id":"155146","ProductId":"P1000-01","UserId":"A19XFXSWFX1CW3","ProfileName":"Mater Lea","HelpfulnessNumerator":2,"HelpfulnessDenominator":2,"Score":5,"Time":"1234224000","Summary":"Good Deal - Good Oil","text":"I've been using coconut oil for years.  I took several T. a day for 2-3 years but never lost weight, so I can't recommend it for that.<br /><br />To eat several T. daily, I made a concoction of chocolate melted with coconut oil and kept it in the fridge.  I found that I ate less sugar and chocolate that way--the coconut oil helped me feel satisfied with a little less chocolate. But, perhaps you can see why I wasn't losing weight . . .<br /><br />By making this coco/choc mixture, I was able to add fruit or ground flax seed (I'm allergic to nuts and this gave the choc/coconut oil a nutty flavor like a ganache) or wheat germ (a nutty-like crunch).  These additions helped me maintain a good glycemic index while eating so much candy.<br /><br />When I was using the coconut oil daily, my total cholesterol did rise but my ratio of HDL:LDL greatly improved.  I do believe that coconut oil is the best one to use, I'm just not much of an oil user.<br /><br />Perhaps if I had been substituting for something besides chocolate, I might have lost weight.  I was really adding oil to my diet instead of swapping.  But, even adding 3-4T. daily, I didn't gain weight, either, and I did get the improved cholesterol ratio.<br /><br />By God's grace, I stopped eating sugar in 2008. Now, I use coconut oil on weekends as my \"weekend treat\" in homemade popcorn.  (Not eating sugar really made me lose weight:  1#/week for 30 weeks, where I've remained for months.)<br /><br />This Nutiva jar is easy to open.  It's probably good to keep smaller amounts in another container to keep the big jar less contaminated . . . but I don't always do that.<br /><br />There was a slight coconut scent at first but that disappeared.  When I lick off the spoon when I make popcorn, I can taste a little bit of coconut, but not much.  I'd highly recommend this brand unless you really wanted that coconut scent.  the lack of scent does make it extremely versatile and much easier to substitute as a butter spread (hot vegetables, toast, etc.)"}