{"Id":"240445","ProductId":"P1000-01","UserId":"A2WN1QF8GSVHYV","ProfileName":"Altmed","HelpfulnessNumerator":1,"HelpfulnessDenominator":1,"Score":3,"Time":"1345334400","Summary":"Food dogs seem to love, maybe not the healthiest, but keeps them happy!","text":"I'm not sure kibble foods are the best, and they do vary in ingredients. I'd call this \"junk food\" food dogs, as they seem to love it, even though some of the ingredients are arguably not the best for dogs. There are added vitamins & healthy stuff in there too.<br /><br />I know a number of dogs that eat this exclusively & some have problems with it, others are just fine on this food & not on the \"healthier\" dog foods. I think, as with human foods, you have to find what works for your dog.<br /><br />Some of the so-called \"healthier foods\" dogs may not like, thus eating less or not at all,or get sick from ultra-high protein diets.<br /><br />I think you have to find what works best for your dog. I wouldn't use this as an every day food for a dog, but once in a while I think it's OK to give a dog that corn, which is number 1 ingredient, as some argue that they don't digest it, but if your dog likes it & does well on it, then they may need some indigestible fiber, in which case, this makes sense - especially if it helps a dog that is otherwise constipated.<br /><br />I think you have to work with your dog & make that decision for yourself, your vet & your dog.<br /><br />If you dog is getting ear infections, candida infections, hot spots, etc. you need to obviously change their diet & this is likely not a good food for that dog, as the fillers are clearly not something they are tolerating, nor do they need.<br /><br />I'm all for a mid-range food, as some of the very expensive foods may be too high in protein without the enzymes to break it down. I'd suggest reading the labels, look up the needs for your breed of dog & any special needs they may have, your dog's activity level, any special needs, such as a hunting dog, a high performance agility dog, or is your dog a lap or yard dog that isn't every active, just a daily walk.<br /><br />Is your dog a high energy dog? They might really like this & benefit from it occasionally.<br /><br />It's difficult to say weather any dog food is \"good\" or \"bad\" when there are SO many breeds, cross-breeds & great animals of unknown breeds that you may guess right or may not. As long as your dog is & stays healthy & active & is eating \"right\" (depending on their constitution), then you're probably OK.<br /><br />I'd consult a vet or animal nutritionist to find what is best for you dog. If your dog has certain health problems, or is a breed susceptible to certain problems, I think you have to adjust their diet accordingly in order to keep them healthy.<br /><br />Dogs & humans have very different needs, so again, read up, contact your vet & find out what is best for your dog!"}