{"Id":"292162","ProductId":"P1000-03","UserId":"A3UP5T3NEQ0E5S","ProfileName":"Gilkissin","HelpfulnessNumerator":429,"HelpfulnessDenominator":436,"Score":5,"Time":"1218499200","Summary":"Manuka magick!","text":"This is an excellent quality Manuka Honey product.  There is a bit of confusion over the UMF, MGO and OMA rating thing.  UMF is the original and trademarked.  MGO is a newer rating system that does not directly correlate to UMF but is accurate nonetheless.  OMA is Wedderspoon's own rating system for determining activity within the raw honey. From my reading it appears to be pretty equitable to UMF.  This honey is also USDA Organic certified (although that doesn't mean as much these days) to ensure that there are no additive ingredients to the product.<br /><br />As for usage, I have two jars of this honey.  I used the first on my wife's wounds following MOHS surgery for removal of skin cancer.  The results were amazing and the surgeon and plastic surgeon both asked what we were using to allow the wounds to heal up so quickly with minimal scarring.  There was also a staph infection as a result of the surgery that the honey took care of as well.  It takes a bit of diligence to ensure daily dressing changes with fresh honey, but the results pay off.  I ended up pre-soaking gauze with the honey and sandwiching between two layers of plastic wrap to create more manageable \"bandages\".  These were used by my wife when she traveled in addition to direct application to the cleaned wound bed.<br />Basic process: Clean wound with Hydrogen Peroxide, follow with colloidal silver in nebulizer, then drizzle honey into wound and cover wound with pre-soaked gauze pad.  The last bit is to cover the pre-soaked pad with a waterproof dressing like a Telfa-style pad to reduce oozing onto clothing/bedding.  Care must be taken in finding adhesives that do not irritate the skin too much with the frequent dressing changes.  There are also larger waterproof wound dressings with silver-impregnated that might be a good combination.  Main idea is to minimize air-space and keep honey in constant contact with wound bed.<br /><br />If this all sounds new, do some research on honey for wound care at the University of Waikato in New Zealand courtesy of Dr. Peter Molan.<br /><br />Note, this honey is not \"sterilized\" via gamma radiation (which is not supposed to reduce activity in the honey like pasteurization) but is still highly effective.  Honey is resistant to most any spoilage due to its activity and the sterilization process is just an extra step some honey manufacturer's take (Comvita or Summerglow) to be able to sell their products as medical devices in the US.  It will allow the honey to be FDA-approved.  Again, as I understand this is not a requirement but is done largely to gain approval for medical usage in hospitals and clinics.  Check out Medihoney dressings. BTW, I have also used this topically on oral canker sores with great effect! Sores dissappeared in days and not weeks! Applied directly 3 x day.<br /><br />Lastly, the other jar I use for tea and even coffee and it is delicious.  It has a strong floral taste and finish (as would be expected) and is alittle more viscous than other Manuka honeys I have tried.<br /><br />I have tried nearly all Manuka honey brands from NZ as I visit often and find this to be a great option for those of us who need a high-quality active raw Manuka honey without paying a load for shipping up the stuff from down under.  Or you can just ask a friend heading that way to bring you back some :P","Description":"Berrie Crunch"}