{"Id":"189439","ProductId":"P1000-04","UserId":"A3JVCRSVH20SLJ","ProfileName":"Amazon Fan","HelpfulnessNumerator":1,"HelpfulnessDenominator":1,"Score":5,"Time":"1330473600","Summary":"Excellent product!!!","text":"Nutiva's brand of organic EV hexane-free coconut oil is awesome. First, I admit it's the first and only one I've tried, but after reading scores of reviews and my holistic health practitioner suggesting I take in 2 Tbsp. a day, I wanted the best. And at Amazon, you get the best prices, especially with Subscribe & Save (how great is that?)!<br /><br />When I opened the jar the very first time, I was amazed at the deliciously fresh coconut aroma. It's intoxicating! I do like coconut, so that helps. But it took me a while to get up the nerve to heat it up and pour it into my frozen fruit smoothie (frozen banana, strawberries, blueberries, juice). I thought somehow it'd solidify back up and I'd get big chunk-o-fat globules in my shake. Not at all!<br /><br />When I heated it up on the stove so that it'd liquify, the scent was of toasted coconut (mmmm, so yummy), so I thought it'd taste great in my smoothie. What surprised me was that it added no taste at all. I'm now using it every day, as suggested.<br /><br />Then it took me a while to try frying with it because I figured it'd impart mild coconut flavor to my savory dishes (potatoes, chicken, eggs), which I wouldn't want. But I just tried it over the past two days, a little with scrambled eggs and a lot with searing boneless breasts of chicken (which were finished in the oven on a tray coated with more coconut oil). I tasted zero coconut flavor in any of it! I am so psyched about this! So now I'll be using organic olive oil for dressings and other raw applications and coconut oil with nearly everything else.<br /><br />Also, I read that the plastic tubs it comes in are BPA-free...fabulous! Haven't tried baking with it yet, but I did use it on my very chapped hands, and it was great. Smells like ole Hawaiian Tropic!!! I love that beach smell!<br /><br />I highly and enthusiastically recommend Nutiva Coconut Oil...it is awesome!!!!"}