{"Id":"155218","ProductId":"P1000-01","UserId":"A1N7BFJSBP75A8","ProfileName":"Glitter Girl \"Amy Elizabeth Gibb Gish, Esq.\"","HelpfulnessNumerator":68,"HelpfulnessDenominator":69,"Score":5,"Time":"1233273600","Summary":"THIS STUFF IS INCREDIBLE!!!","text":"This is amazing.  I like it better than all other coconut oils.  Of course it tastes like coconut.  I don't want to use oils that are so overly processed and refined that they taste like \"nothing\".  I don't understand why the coconut flavor bothers some people.  If you don't like coconut, find a different oil.<br /><br />You can use this for grilling, frying, baking, sauteeing, greasing & flouring a cake pan, and all other places that you'd use butter or a Crisco-type product.  Just be careful on the baking because this melts at a low temperature.<br /><br />It is amazing as a skin softener, a hair conditioner, a leave in hot oil treatment, make-up remover, eyelash conditioner/glosser, shaving \"cream\", lip softener, cuticle oil, nail conditioner, bath oil, after bath oil, massage oil (add a few drops of essential oil if you wish), etc.  Speaking of massage oil, this is an excellent product for \"adult activities\" . . . as a perk it is definitely edible.<br /><br />If you have dry feet, slather this on, rub it in, wrap your feet with plastic wrap, cover with socks, and go to bed.  In the morning your feet will feel nice and soft.<br /><br />This can be used on leather such as shoes, jackets, and purses.  Because it's clear, you can use it on leather products that have decorative stitching that you can't cover with regular colored polish.  (In fact, I just bent over and put coconut oil on my black leather shoes with my fingers . . . the only clean up needed was to rub my hands together.)<br /><br />I've even used it on my wood furniture to obtain the same results as furniture oils.  I have used it to grease hinges and mechanical parts.  I have heard that you can use it to add lustre to pearls but I'm too chicken to try it on my good stuff.<br /><br />I know people that have used it as a laxative (in large quantities) and a diet aid.  When I eat about a T. a day my skin is softer and my wrinkles are less noticable.<br /><br />I keep finding new uses.  I'm sure you'll find some, too.","Description":"Toasted Oats"}