{"Id":"240117","ProductId":"P1000-01","UserId":"AQ6AGWKWMTY8H","ProfileName":"Pam Tee \"mom,wife,fur-mom,book-blogger\"","HelpfulnessNumerator":27,"HelpfulnessDenominator":35,"Score":3,"Time":"1339804800","Summary":"Some Good, Some Bad","text":"Last year we got our first family dog- a rescue JRT-mix.  My family had so much fun with Charlie-Amanda that we soon adopted another pooch, Pippin.  If you're wondering why I'm telling you all this, it's so that you have the background on where I'm coming from with respects to this review.  Essentially we love our pups and I spent a lot of time last year reading up on dog foods.<br /><br />PACKAGING:<br />The 15.5 pound bag of Beneful dog food comes nicely packaged.  It was delivered in a box that was appropriately sized.  The Beneful bag itself is super sturdy, plasticized, and has what looks to be a sturdy 'ziplock' opener at the top.  This is just the sort of thing you need with a large amount of kibble to keep it fresh and appealing to dogs.  So bonus points here (although the superior option would be biodegradable).<br /><br />THE KIBBLE:<br />The kibble is attractive and smells okay.  There are different sizes, shapes, textures, and colors.<br /><br />MY DOGS REACTION:<br />As I mentioned, I've got two pups.  One's a year old JRT-mix and the other's a 8 month-old Moyen-sized poodle.  They both thought that the food smelled interesting, but they didn't chow it down.  They would eat quite a bit if I hand fed them the kibble, but they'd only eat out of the bowl if they were very hungry.  In fairness I should note that they are the pickiest eaters in the universe, and sometimes they'll even turn their noses up at human chicken and hot dogs.  I expect most dogs would eat this food.  Certainly our neighbor's dog, who is always breaking into the house to scour it clean, gulped down every little tidbit.<br /><br />NUTRITION:<br />--Much research has led me to understand that it can be difficult to calculate the actual price of a dog food.  \"Cheap\" dog foods, for example, may not be as cheap as they seem because dogs need to eat more of lower quality food than higher quality.  If you look at this example you'll see what I mean.  The Beneful package suggests that a dog of 15 pounds should eat around 1.25-to-1.7 cups of food per day.  A similarly sized dog need only eat 1 cup of Eukanuba small breed kibble.  Now Eukanuba appears to be more expensive per bag, but is it?<br /><br />My point is that those of us who are frugal need to crunch the numbers before they purchase.<br /><br />--Beneful is a low quality food source for dogs.  Dogs are omnivores but they really need protein and the first ingredients for Beneful are ground yellow corn, chicken by-product meal, corn gluten meal, whole wheat flour.  Compare their 25% protein product with what I'm currently feeding my dogs which has 32% protein, and whose ingredients are Chicken, Chicken By-products and Corn meal.  And there are other products out there with even higher protein levels.<br /><br />--Keep in mind that some dogs are allergic to corn and food dyes.  If your pup is one of these, skip Beneful.<br /><br />CONTROVERSY:<br />--There's a number of controversies surround Beneful and it's manufacturer, Nestl&eacute; Purina.  The parent company, Nestl&eacute;, has been involved in a number of recalls for both human and pet foods.  They use ingredients from China for the dog food, and there are many complaints against them in 2012 for dog treats.<br /><br />--The Dog Food Advisor website gives Beneful 1-Star for high fat and carbohydrate levels.<br /><br />CONCLUSIONS<br />Beneful is an okay product.  It's the type of dog food that my grandmother would have purchased in bulk to feed the strays she was always taking in.  It is VERY convenient to have it delivered, and the packaging is excellent, and for some people who have a difficult time getting out of the house, this is going to be a great option.<br /><br />Currently Beneful appears to be safe to use.  Nestl&eacute;'s reputation is not sterling however and dog owners should keep an eye to the news for recalls and reports of poisons since Purina uses foodstuffs from China.<br /><br />Pam T~<br />mom and fur-mom"}