{"Id":"240480","ProductId":"P1000-01","UserId":"A1BAJ6JXU8PSZH","ProfileName":"LRK","HelpfulnessNumerator":1,"HelpfulnessDenominator":1,"Score":4,"Time":"1344211200","Summary":"Dog Loves It","text":"What does dog food need to do to be good?  The dog needs to like it and it needs to keep the dog healthy.  I'm very pleased with this dog food on those premises.  My dog (who likes table scraps way more than she likes dry dog food...we usually use Purina Dog Chow)...she loves this food.  It is hard to get her to eat more than one bowl a day...she ate two bowls of this immediately when she first tried it and when I add an egg to this dry food she eats the egg...and continues on to eat the dry food too so I don't have to mix the egg in.<br /><br />I'm not too impressed with either the ingredients or the price (more for a 15.5lb bag than for 44lbs of PURINA Dog Chow...with no real improvement in ingredients).  Regarding another review of Beneful discussing the ingredients (yes it is probably healthier to feed raw meat etc) I do need to state that in spite of all the grains and meals in PURINA's dry foods, my dogs have all been very healthy eating this brand...several large breeds over many years, including a wolf dog whose digestive system was very sensitive to grains and leftovers.  He did fine on Purina as did his parents who were mid-content wolf.  The breeder actually recommended PURINA for her low and mid-content wolf dogs after researching the company and their meat sources.  I think it says a lot that so many dogs of different breeds (German Shepherds, Pyrenees, Malamutes, Huskies, Wolf mix, Retriever, Lab) activity level and ages have stayed very healthy on this brand of dry food for many years.  It is very consistent and if based strictly on results (and ignore the ingredients) I have been very pleased.<br /><br />The 15.5 lb bag lasted about 2 weeks for my 80 lb Great Pyrenees eating her fill.  She loves it, so eats enough of it to keep weight on, which is quite an accomplishment with this particular dog.  Her coat looks good, her eyes look good, and she has a lot of energy.  I may just switch to Beneful for this dog if I can find it a little cheaper."}