{"Id":"240310","ProductId":"P1000-02","UserId":"A2AWVROFGSZU4E","ProfileName":"My Fake Name","HelpfulnessNumerator":3,"HelpfulnessDenominator":5,"Score":3,"Time":"1339027200","Summary":"It's OK","text":"***<br /><br />One thing I don't like about PURINA Beneful Original Dog Food, 15.5-Pound is the price as offered on Amazon right now.<br /><br />I do like the bag, though.  One reason is there's a photograph of a dog on the front, and that dog looks really startled.  It's kind of arresting, and you find yourself doing a double-take, because you so rarely see a dog look startled, with great big wide-open eyes.  Also, he's wearing a police badge on his collar because he's a police dog.  (Arresting, get it?)<br /><br />Another reason I like the Beneful bag is that Eukanuba, my dogs' normal brand, comes in a paper bag with a grease-proof liner whereas the product under review comes in a sturdy plastic bag, like thick Tyvek, that has a simple zip-type closure with a little handle that works every time.  I like the bag so much that I now store excess Eukanuba in it.  Also, last time I bought a bag of Eukanuba and placed it on the floor of the backseat of my car, a woman backed out in front of me and I had to hit the brakes quickly, which meant that my dog, which was also in the backseat, got thrown forward and ended up falling off the seat where, unbeknownst to me, he placed a foot right into the middle of the Eukanuba paper bag and punched a paw-size hole all the way through both layers, which would not have happened with the Beneful bag.  Imagine my surprise when I pulled the bag from the backseat and strewed dog food pellets all over the car and the garage floor.<br /><br />I was not surprised the dog did not set about snarfing down the food he had liberated from its bag, and here's why.<br /><br />***<br /><br />AD LIB FEEDING<br /><br />I have successfully fed all my pets, five cats [see update at bottom] and two dogs so far over the years, ad lib, and I strongly recommend you try it.  Ad lib is short for the Latin phrase ad libitum, which means \"at liberty\" or \"at one's pleasure.\"  Feeding ad lib means you eat as much as you want.<br /><br />The benefit of my pets' feeding ad lib throughout their lives is that I can leave out weeks' worth of food at a time rather than having to measure and dole out portions every day.  From the moment I've gotten each new pet home the first time, I've always made sure there was a huge amount of food available in their feeding vessels.  When they come to realize there will always be more food than they can possibly eat all at once, they automatically regulate their feeding to what they need.  None of those pets ever overfed themselves.<br /><br />If you ration out one day's worth of food a day, those pets will always eat it all up and wait for the next day's feeding, which they will always eat up.  They will quickly realize that the supply of food per day is limited, and they will want to always eat all of it, which means you must then continue to limit their daily portions lest they overeat.  Ad lib feeding is MUCH better.<br /><br />I feed my current dog -- which is also the best dog in the world and I can prove it -- from a tub that holds 30 pounds of Eukanuba.  I feed my current cat -- which is the prettiest cat for miles but socially inept -- from a large emesis basin I stole from my mother's hospital room several years ago.  (Hi, Mom, and I'm glad you didn't need to throw up!)  As a result I have to add dog food maybe once every couple months and cat food every three.  Let's compare ad lib feeding to daily feedings.<br /><br />Whether they feed on rationed daily portions or ad lib, your pets will need you to do the following each time you feed them:<br /><br />1. Locate and haul out the container of the pet's food.<br /><br />2. Open the container.<br /><br />3. Dose out the food into the pet's feeding vessel.<br /><br />4. Seal and store the container of the pet's food.<br /><br />If you perform these steps once a day for one dog and one cat, that's 730 such operations in a year.<br /><br />The way I do it, it works out to only about ten such feedings a year.  That's 73 times better, which is why I say ad lib feeding is better.<br /><br />But, just to make sure you understand, (1) you want to get your pet started on ad lib feeding the instant it gets home, and (2) you want to make sure its feeding vessel never gets too close to empty.  Your pet should always be able to see and smell that there's always more food than it can eat.  As I said, this has worked for me for a total of seven cats and dogs [see update at bottom] out of a total of seven dogs and cats in the sense that none of them has ever overfed.<br /><br />***<br /><br />My current dog, whose name is PheyeG'hdeaux, really prefers Beneful to Eukanuba.  Maybe it's because he got bored with Eukanuba and wanted a change of taste.  You know how if you eat your favorite food for too long even it, your very most favoritest food, starts to pall?  Maybe dogs are the same way.  It seem like they would be.  Cats too, and giraffes and hamsters and monkey-eating eagles, I would guess.  I know my dog prefers Beneful to Eukanuba because when I mxed the two in his tub he actually went to the trouble of rooting through the various pebbles to track down the Beneful ones.<br /><br />(People who've had a chance to observe and learn about PheyeG'hdeaux agree he's the smartest dog ever.  He learned Shake, Sit and Down in fifteen minutes, although to be fair he was trained by Annette, who is and always will be a former professional dog trainer, although to be fair she says she wasn't training dogs, she was training dog owners.  Anyway, to be fair, PheyeG'hdeaux isn't all THAT smart, and the reason I say that is that I beat him a good four out of five times in chess.  I'm all the time having to remind him about elementary things like, \"Don't bring your queen out too early\" and \"Don't forget about capturing en passant.\"  Sheesh.  None of this has anything to with how good Beneful is or is not, which is why it's in parentheses.)<br /><br />I am concerned that the first ingredient in PURINA Beneful Original Dog Food, 15.5-Pound is corn-based.  Humans don't process a lot of corn well, as you (ahem) might have observed, and I'm just guessing dogs don't either.  (Now I have to tell you about how, according to <a href=\"http://www.amazon.com/gp/product/0316082678\">Bartlett's Book of Anecdotes</a>, \"After receiving a bad review from Munich critic Rudolf Louis, [German composer and organist Max] Reger wrote to him: 'I am sitting in the smallest room of my house.  I have your review before me.  In a moment it will be behind me.'\")  Also, if I may be permitted to continue in this indelicate vein, on Beneful PheyeG'hdeaux's, er, gaseous emissions have a different smell, although I can't say it's necessarily any better than when they're fueled by Eukanuba.  Funny how dog food manufacturers never discuss this particular asspect of the ingredients they choose, don't you think?<br /><br />Finally, as some of you might have come to expect, I have taken the product under review outside the expected criteria such as, in this case, nutritional value and price and convenience and taste.  I can tell you that when you grind up this Beneful into a dust and sprinkle it on a Caesar salad, it remains unimproved.  The salad, I mean.  Same with pizza.<br /><br />And especially ice cream.  Beneful dog food dust is truly awful on almost every flavor of ice cream.  But then, to be fair, so is Eukanuba dust.<br /><br />Also, if you pour some into cereal bowls and serve them to your kids with a spoon and a carton of milk, they will not eat a second bite no matter what you do or say, which is too bad because this Beneful dog food, even at the price at which it's on offer at Amazon right now, is a lot cheaper than the same weight of corn flakes.  And, come to think of it, the main ingredient is the same.<br /><br />Did you figure out how to pronounce PheyeG'hdeaux?<br /><br />***<br /><br />UPDATE OF JULY 27, 2012:<br /><br />Since I wrote the review above, a sixth cat has been added to the list of pets that feed successfully ad lib, so it's eight dogs and cats, not a mere seven.","Description":"Peanut Butter Crunch"}