{"Id":"240349","ProductId":"P1000-01","UserId":"A3TAS1AG6FMBQW","ProfileName":"Jeri Zerr \"formerly a Road Rarrior of the Nth...","HelpfulnessNumerator":1,"HelpfulnessDenominator":2,"Score":2,"Time":"1343260800","Summary":"Beneficial dog food? Not really...","text":"Purina has named this dog food Beneful implying the food is beneficial for dogs.  Well.. it is.. to keep them \"alive\" but not much else. I would not feed this product to my dogs on a regular basis, if at all. Sure the cost per pound is cheaper than the grain free selections such as <a href=\"http://www.amazon.com/gp/product/B000W5SLB8\">Taste of the Wild Dry Dog Food, Hi Prairie Canine Formula with Roasted Bison & Venison, 30-Pound Bag</a> or <a href=\"http://www.amazon.com/gp/product/B00609PJEC\">Hi-Tek Naturals Grain Free Lamb Meal and Sweet Potato Formula Dry Dog Food, 30 Pounds</a>, but once serving size and reduced veterinary bills are factored in, the implicate cost savings of these cheaper cereal based dog foods is usually not realized.<br /><br />Purina's marketing states Beneful has added color (yellow #5, red #40, yellow #6, blue #2) - these are artificially produced (chemical) FD&C food colors, some of which are derived from petroleum. Do you think these artificial colors are included as a benefit to the dog?  Now I realize why in the past when a dog had a fecal accident on carpet it stained the carpet so permanently...<br /><br />Ingredients:  Ground yellow corn, chicken by-product meal, corn gluten meal, whole wheat flour, animal fat preserved with mixed-tocopherols (form of vitamin E), rice flour, beef, soy flour, sugar, propylene glycol, meat and bone meal, tricalcium phosphate, phosphoric acid, salt, water, animal digest, sorbic acid (a preservative), potassium chloride, dried carrots, dried peas, calcium propionate (a preservative), l-lysine monohydrachloride, choline chloride, added color (yellow #5, red #40, yellow #6, blue #2), DL-Methionine, Vitamin E Supplement, zinc sulfate, ferrous sulfate, manganese sulfate, niacin, Vitamin A supplement, garlic oil, pyridoxine hydrochloride, riboflavin supplement, Vitamin D-3 supplement, menadione sodium bisulfate complex (source of vitamin K activity), calcium iodate, folic acid, biotin, sodium selenite.<br /><br />My concerns (alarm!) stems from the primary ingredients being corn (fed to cows to fatten them up before slaughter), chicken by-product meal (it means the discarded portions of chicken - the heads, beaks, feet, feathers, etc is ground together), corn gluten meal (again more corn to fatten up the animals), and whole wheat flour (Really?  Do the dog's nearest relatives, such as wolves or foxes, eat grains in the wild?) which is very well known in Asian culture as being much harder on digestion than other grains such as brown rice.<br /><br />The customer service can be reached at 1-888-BENEFUL for information or questions. My first question is why are they adding the artificial colors, at least some of which are made from petroleum?  The color isn't for the dog's selection...<br /><br />I gave this product a whole 2 stars simply for the packaging.  The zipper seal bag is a nice addition to help keep the food fresh.  I would prefer Taste of the Wild or Hi-Tek came in a zipper seal bag of similar quality."}