{"Id":"21820","ProductId":"P1000-03","UserId":"AZ4IFJ01WKBTB","ProfileName":"K B","HelpfulnessNumerator":1,"HelpfulnessDenominator":1,"Score":5,"Time":"1291680000","Summary":"we use it daily","text":"to save my time and yours - i've included a multi-item review<br />we love the idea of draining a dog's energy, stimulating their mind, giving them a fun challenge, and feeding them all in one. we have bought a lot of the products that do just that.<br />the <a href=\"http://www.amazon.com/gp/product/B0006G54OU\">Buster Food Cube Large Size (Colors May Vary)</a> was one of the first products we bought. it does what it says. the only downside is loading it takes time and is kind of a pain.<br />we have since moved on to the<a href=\"http://www.amazon.com/gp/product/B003ALMW0M\">Kong Wobbler Dog Toy</a>, <a href=\"http://www.amazon.com/gp/product/B003ARUKTG\">OurPets DT-10504 Smarter Toys IQ Treat Ball, 5 Inches</a>, and <a href=\"http://www.amazon.com/gp/product/B000KV7ZGQ\">Premier Busy Buddy Tug-A-Jug, Medium/Large</a>. all of which are easier to load and accomplish the same goal.  we use one of these daily to feed our buddy or fill it with treats to occupy him for a little while.  all three get pushed around until all the treats are gone - we have carpet so it's not as noisy as others have mentioned.<br />the kong wobbler is bigger than you would expect and it is a little heavy too - but out of the three our dog likes it the best.  the whole is big so, as other reviewers have mentioned, you may need to devise a way to make it smaller.<br />the iq treat ball is awesome.  easy to load and you can adjust the difficulty.  just rolls and rolls until the treats are gone.<br />the tug-a-jug is more challenging than the other two - but once your dog figures it out they get the treats no problem.  small treats do come out easily so we add larger chunks to add to the challenge.<br /><br />p.s. we also tried the <a href=\"http://www.amazon.com/gp/product/B0002I0RLW\">Premier Pet Busy Buddy Twist 'N Treat Dog Toy, Small</a> but it was a pain to load as well - twisting and un-twisting the hard plastic was not as easy as it should be.  and in less than a year the plastic stem tore and broke leaving it useless."}