{"Id":"240124","ProductId":"P1000-01","UserId":"A1QK0XCAPHIW1L","ProfileName":"Flush Barrett-Browning","HelpfulnessNumerator":2,"HelpfulnessDenominator":2,"Score":4,"Time":"1343174400","Summary":"Fred Votes Yes!","text":"Selecting a pet food is a complicated process.  It's no longer a case of `will my dog eat this?'  Nor even, `is it a well-balanced diet?'  Instead, for many of us, it has become a case of worrying about the safety of the food we offer our pets.<br /><br />Purina Beneful Original Dog Food does offer a balanced diet that fulfills the nutritional requirements of a healthy dog.  Below the are oft-cited ingredients in Beneful and those in Hill's Science Diet, my dog's usual nosh.<br /><br />Beneful:  Ground yellow corn, chicken by-product meal, corn gluten meal, whole wheat flour, beef tallow preserved with mixed-tocopherols (source of vitamin E), rice flour, beef, soy flour, sugar, sorbitol, tricalcium phosphate, water, animal digest, salt, phosphoric acid, potassium chloride, dicalcium phosphate, sorbic acid (a preservative), l-lysine monohydrochloride, dried peas, dried carrots, calcium carbonate, calcium propionate (s preservative), choline chloride, vitamin supplements (E, A, B12, D3),<br /><br />Hills:  Chicken, Whole Grain Corn, Whole Grain Sorghum, Whole Grain Wheat, Chicken By-Product Meal, Soybean Meal, Corn Gluten Meal, Animal Fat (preserved with mixed tocopherols and citric acid), Brewers Rice, Chicken Liver Flavor, Lactic Acid, Soybean Oil, Flaxseed, Iodized Salt, Potassium Chloride, Choline Chloride, Vitamin E Supplement, L-Lysine, vitamins (L-Ascorbyl-2-Polyphosphate (source of vitamin C), Vitamin E Supplement, Niacin, Thiamine Mononitrate, Vitamin A Supplement, Calcium Pantothenate, Biotin, Vitamin B12 Supplement, Pyridoxine Hydrochloride, Riboflavin, Folic Acid, Vitamin D3 Supplement), Calcium Carbonate, minerals (Ferrous Sulfate, Zinc Oxide, Copper Sulfate, Manganous Oxide, Calcium Iodate, Sodium Selenite), Taurine, preserved with Mixed Tocopherols and Citric Acid, Phosphoric Acid, Beta-Carotene, Rosemary Extract.<br /><br />Do all these ingredients in either brand come from the United States?  Not so far as I can tell.  I can't find information anywhere on the package that says where the ingredients are from.  Does this make me uncomfortable?  Yes, it does.  But there are few affordable dog foods that give this information.<br /><br />My dog likes the taste of Beneful better than the Hill's (I`m not sure that tells us anything; he thinks old shoes taste great). And I know that he's getting a balanced diet when he eats any Purina food, whether or not meat is the first listed ingredient, and whether or not it contains corn (which he digests quite well).<br /><br />But I'm far more interested in learning the country of origin of the ingredients than in seeing the list.<br /><br />I'm giving Beneful four stars because it does what it claims - it gives my dog a balanced diet.  But I'm deducting one star because I want more information than I'm getting."}