{"Id":"189444","ProductId":"P1000-04","UserId":"A30L4Y3Y16ZA73","ProfileName":"K. Santanen","HelpfulnessNumerator":56,"HelpfulnessDenominator":56,"Score":5,"Time":"1278115200","Summary":"Excellent, Clean-Tasting Coconut Oil","text":"First things first: the flavour of this coconut oil is wonderful. Very clean on the tongue with just a slight back hint of coconut flavour. YES, this WILL slightly flavour some of your dishes to taste faintly of coconut if the dish is not heavily spiced. When I use coconut oil in place of butter for many Ethiopian and Indian dishes, I don't really notice any coconut flavour--but these are heavily spiced cuisines and so the sheer level of spice involved will cover up the delicate coconut flavour of this oil. In baking, however, there is a wonderful little hint of it. When I've made cookies and cakes using this in place of shortening or butter, many people have commented that something felt different about the dessert, but they couldn't put their finger on it right away until I would suggest coconut. I say all of this, though, in case someone who absolutely HATES coconut is considering using coconut oil as a part of their diet. While it has many great health benefits, if you cannot stand the flavour of coconut in any shape or form, you probably will not enjoy this product. I personally enjoy the added depth and dimension is gives my food, as well as the fact it's cholesterol free.<br /><br />If you're thinking this wouldn't taste like anything, then you're thinking of what is called \"RBD coconut oil\", that is to say, coconut oil which has been refined, bleached, and deodorised. This is not that product, and in my opinion, is far superior to any RBD coconut oil you could find.<br /><br />Now, the health benefits. Coconut gets props for being cholesterol free. Many people want to downplay its wonderfulness by pointing out that it is loaded in saturated fats. However! The saturated fats found in coconut oil are mostly medium-chain fatty acids, which bind together to form medium-chain triglycerides. Medium-chain triglycerides, or MCTs, are much easier for the body to break down and process than long-chain triglycerides, which are the saturated fats that are usually predominant in our diets. Because MCTs are so easily broken down in the body, they don't put a great strain on your pancreas or digestive system. Coconut oil is not a cure-all, however. It's not some miracle food (IMO), but I do think it should be seen as a healthy, viable alternative to butter and some cooking oils. Should it replace these other oils and butter outright? No, I don't think so. But I think it deserves a place of respect alongside your butter and olive oil in the kitchen."}