{"Id":"240118","ProductId":"P1000-01","UserId":"AKZKG2Z7CNV27","ProfileName":"BreezyPaige","HelpfulnessNumerator":32,"HelpfulnessDenominator":43,"Score":1,"Time":"1330214400","Summary":"False Advertising, Terrible Dog Food!!","text":"I bought this dog food because the bag showed pictured of veggies and chunks of meat, and with a name like \"Beneful\" I thought I was purchasing a nutritious brand of dog food. My dogs did eat this food at first, and slowly began to not like it. After reading the ingredients I completely regret purchasing it and feel just awful for feeding it to my dogs. The first three ingredients are Ground yellow corn, chicken by-product meal, and corn gluten meal. How disgusting is that?! The main ingredient is a corn filler. One thing my vet told me a while back that I never forgot: \"When you eat corn, what comes out of the other end? The same thing happens with dogs.\" Basically, dogs cannot fully digest corn as they are carnivores. Corn it is just a cheap filler that can cause dogs to actually eat more to feel full, poop out more, and retain less nutrients. Most inexpensive low-quality pet foods have lots of these fillers and cheap ingredients with little to no nutritional value.The only meat in Beneful at all is a by-product, its not even a real meat! By-products are the stuff leftover once all the actual meat is harvested. We're talking beaks, chicken feet, eyeballs, even chicken poop! I would not recommend this product to anyone, for any reason, ever. It is an absolutely awful dog food. I can't believe the pictures of veggies and full chunks of meat on the bag can be allowed to be on the packaging if the product does not contain the pictured items; it is very misleading and should be considered false advertising.<br /><br />I recommend to stay far away from Beneful, and most Purina products. When purchasing a dog (or cat) food, the most important thing to consider is the first 3 ingredients; just make sure those first three are decent ingredients that you would eat yourself- provided that you eat a typical (non vegetarian or other restricted) diet. Now that I know what to look for,  I usually buy my pets all natural foods such as Natural Balance, Blue Buffalo, Halo, or Wellness. High-quality foods tend to be more nutritionally dense, meaning you will be feeding a much smaller amount for the same number of calories. If you do the math to figure out the cost for the number of calories you need to feed your pet, many premium foods are CHEAPER than the awful crap you're buying at the grocery store."}