{"Id":"36385","ProductId":"P1000-04","UserId":"A3LGSJUIO91AAG","ProfileName":"Deanna","HelpfulnessNumerator":4,"HelpfulnessDenominator":5,"Score":5,"Time":"1324512000","Summary":"Read before purchasing","text":"Word to the wise before purchasing : your noodles didn't go bad. The slightly fishy smell is normal.<br /><br />If you're expecting to cook a fancy pasta dish with angel hair shirataki noodles and let it replace your normal pasta dishes, don't count on it. Some enjoy using these noodles for Italian dishes, but due to the texture it's not going to be the ideal dish. Would you eat ramen noodles with pasta sauce? These noodles go best as an Asian meal than an Italian one.<br /><br />I don't see why people write 1-star reviews based solely on the smell. Yes, it smells, but it's not overwhelming. I didn't smell it until I stuck my nose in the noodles. Best thing to do: get a bowl and fill it with cold water and possibly some ice cubes. I let them sit in that for about 10-15 minutes and the smell was nearly gone. If you're going to whine and fuss on an Amazon review board about a smell you clearly did not READ THE DIRECTIONS ON THE PACKAGE.<br /><br />Lay the noodles on some paper towels to soak up access water. Shirataki noodles absorb the flavor of the dish, so allow it some time to dry a bit. These noodles are AMAZING with a stir fry. Others say sukiyaki with shirataki noodles are a hit as well.<br /><br />What I did : After completely the steps above, I cut my noodles into bite size lengths and made a slight peanut butter sauce for that Chinese take-out zing. Oils contain a lot of flavor, but only a couple drops of sesame oil really helped. I added plenty of vegetables in a pan with some chopped up chicken breast, added my sauce then dropped in the noodles and let it fry for a bit.<br /><br />...AMAZING! It was delicious and since it was mixed with plenty of other goodies I didn't notice the texture much at all. I cannot wait to buy more of these!","Description":"Chocolate Crunch"}