{"Id":"240457","ProductId":"P1000-01","UserId":"A1FDSZISWIXH1A","ProfileName":"Terry \"TCinSATX\"","HelpfulnessNumerator":1,"HelpfulnessDenominator":1,"Score":3,"Time":"1344988800","Summary":"Average, affordable dog food","text":"I have two dogs - a large lab mix and a small dachshund mix. I am currently feeding them Flint River dog food, which is very high quality and expensive. (I have no affiliation to Flint River products and there are a few other, equally good dog foods available commercially. Flint River is just the one I can easily get from Amazon.) My lab will eat anything, but my dachshund is very picky about food, preferring human food to dog food. He is not especially thrilled about the Flint River, although he eventually eats it.<br /><br />Purina Beneful Original has small, colorful chunks - some of which are moist and chewy. I was surprised to see that my dachshund actually likes the Beneful, eating it fairly enthusiastically. My lab gobbled it right down, although she gobbles everything right down. I am going to keep some Beneful on hand and add a few chunks to my dachshund's Flint River dog food every night to encourage him to eat promptly, rather than wander around for a while looking for something tastier.<br /><br />Beneful is NOT a premium grade dog food, so I will be keeping my dogs on Flint River (at about four times the price). The ingredients tell the story, which I have listed below. However, Beneful is affordable and my dogs definitely seemed to like it. I would say this is average, adequate nutrition for a dog, but could be a problem for dogs with health issues like diabetes, etc.<br /><br />Nutritional information:<br />Crude Protein (Min) 25.0%, Crude Fat (Min) 10.0%, Crude Fiber (Max) 4.0%, Moisture (Max) 14.0%, Linoleic Acid (Min) 1.5%, Calcium (Min) 1.1%, Iron (Min) 175 mg/kg, Selinium (Min) 0.2 mg/kg, Vitamin A (Min) 10,000 IU/kg, Vitamin E (Min) 100 IU/kg<br /><br />Ingredients: Ground yellow corn, Chicken by-product meal, corn gluten meal, whole wheat flour, animal fat preserved with mixed-tocopherols (form of Vitamin E), rice flour, beef, soy flour, water, meat and bone meal, propylene glycol, sugar, tricalcium phosphate, phosphoric acid, salt, animal digest, potassium chloride, sorbic acid (a preservative), dried peas, dried carrots, calcium propionate (a preservative), choline chloride, L-lysine, monohydrochloride, Vitamin E supplement, zinc sulfate, red 40, ferrous sulfate, manganese sulfate, niacin, yellow 6, yellow 5, Vitamin A supplement, blue 2, calcium carbonate, copper sulfate, Vitamin B-12 supplement, brewer's dried yeast, calcium pantothenate, thiamine mononitrate, garlic oil, pyridoxine hydrochloride, riboflavin supplement, menadione, sodium bisulfite complex (source of Vitamin K activity), calcium iodate, folic acid, biotin, sodium selenite."}