{"Id":"240334","ProductId":"P1000-01","UserId":"AOEP96629WHHA","ProfileName":"A. Reid","HelpfulnessNumerator":1,"HelpfulnessDenominator":2,"Score":4,"Time":"1343433600","Summary":"Evidently tasty dog food, but high in carbs, fillers","text":"I have for some years now been feeding my dog a blend of appetizing dog foods with a costly prescription diet for his medical condition. He doesn't always have much of an appetite, and it can be difficult to coax him into eating much. He won't eat the prescription diet unless there's something a little more tempting with it. I don't know; maybe once he gets started he doesn't pay as much attention to the individual elements.<br /><br />On opportunity for review, I picked this up along with a bag of <a href=\"http://www.amazon.com/gp/product/B002LANN56\">Chef Michael's Grilled Sirloin Dry Dog Food</a> to see how these two foods would work for this purpose, and how they'd compare.<br /><br />Either of them does the trick. He was enticed by the smell of the Beneful before I even opened the bag. Put a few pieces on the floor, and he went after it like a dog in a dog food commercial. He gave pretty much the same attention to the Chef Michael's. He doesn't seem much to care which I put in the bowl with the prescription food; he has so far chowed down on each just as happily.<br /><br />Even allowing for the lower portion sizes of Chef Michael, it costs twice as much. Nutritionally, there are some differences between the pair. Beneful has 25% crude protein (minimum); 10% crude fat (minimum); 4% crude fiber (maximum) and a maximum of 14% moisture. Chef Michael has 28% crude protein (minimum); 16% crude fat (minimum); 3% crude fiber (maximum) and a maximum of 12% moisture. I've been doing some reading on dog food ingredients, and while I'm no expert what I've read suggests that the Beneful is heavy on carbs and, while its top protein source (chicken by product; second on the list) is a decent protein, it's not necessarily a highly digestible food due to its heavy reliance on corn. Chef Michael starts with beef.<br /><br />That considered, I'm not sure that the Beneful would be my first choice for mixing in with my dog's food, although in the right proportion I feel comfortable enough with it. With his tricky health, I don't think I would use either of these solely, but they both do the trick. While neither is exactly a health food, I can't pretend that everything I eat is the healthiest option, either. These are decent supplements, but I personally would not use them as mainstays."}