{"Id":"36386","ProductId":"P1000-04","UserId":"AVIA6QH2984QE","ProfileName":"Tahereh Safavi \"awibs\"","HelpfulnessNumerator":4,"HelpfulnessDenominator":5,"Score":5,"Time":"1321660800","Summary":"Tastes just like cellophane noodles! Great for pho!","text":"This is the new best thing ever! As an ABC (American Born Chinese) I have had many kinds of noodles over the years, made of many grains (mostly rice or wheat, but also things like quinoa or soba) and in many textures. The reviews that say the texture is horrible are probably from people accustomed only to white semolina Italian-American pasta. No, this does not taste like the spaghetti you get from cosco. It is also not the processed white flour Maruchen ramen that many Americans know as their only representation of Asian noodles. The texture is just like cellophane noodles, which are used frequently in Thai and Vietnamese food. If you are not sure if you will like the texture go to your local Vietnamese enclave and have a bowl of Pho. Those transparent noodles with a little bit of \"bite\" or \"crunch\" almost to them? That's what these are. Not slimy or slippery like semolina pasta. They don't just dissolve and break when you slurp them, you actually have to bite them off. They abosrb broth really well - try yours in a beef broth with roast slice beef and cilantro, green onions, lime and bean sprouts. Use plenty of garlic and hot chili. You won't miss a thing!<br /><br />No unnatural ingredients, high fiber and no calories! This solved two of my dietary inefficiencies with one stone - needing to add fiber supplements to my yogurt and smoothies, and the empty calories in noodle soup. Now I can have a big bowl of protein, veggies, broth and fiber with no empty processed carbs in the way! I'll be saving my carbs for important things like fruit... and chocolate :><br /><br />Post Script: For the people who insist the noodles \"smell like fish,\" or \"smell like rotting,\" I would like you to try a little cultural sensitivity experiment, and go to your local Korean, Vietnamese, Japanese, Thai, or Chinese marketplace, and take a big deep breath. Smell that?<br /><br />It's fish. Actual, came-from-the-ocean fish. It might be fresh like sashimi or it might be dried, smoked, or pickled, depending on what flavor of Asian store you stumbled into. We eat them, you know, in forms other than breaded and deep fried. Now go smell something like kim chee, miso, or 100-year eggs. That smell is known as fermentation. Say it with me, fer-men-TA-shun. That is not the same as rotten. It is a deliberate conversion of carbohydrates to alcohol under anaerobic conditions utilized for change in flavor, texture, and quality. You may discover parallels in your Nice Normal People foods like cheese and beer.<br /><br />Before you rail on about how disgusting this product is because in your ignorance you dumped salt-free marinara on it (ew) consider trying to find one of us slanty-eyed dark-haired people and asking nicely to try our food. Then if you don't like it, please consider thinking, \"Gee, I guess my palate doesn't care for Asian flavors,\" rather than ordering Asian noodles and crying \"rip-off\" because it tastes EXACTLY LIKE WHAT IT IS.","Description":"Chocolate Crunch"}