{"Id":"189449","ProductId":"P1000-04","UserId":"AGTBEWGF0VHHA","ProfileName":"Observant I","HelpfulnessNumerator":22,"HelpfulnessDenominator":23,"Score":4,"Time":"1298592000","Summary":"Fresh, flavorful, and hexane-free","text":"I've tried a few different brands of extra-virgin coconut oil, and for the most part I'm equally satisfied with them all. Despite the marketing hype, coconut oil brands within each category (virgin, refined, hydrogenated) are very similar. I should specify the qualities I look for in a coconut oil: I want a coconut oil with a rich coconut aroma and taste, maximum nutrition, and minimal processing. For these reasons, I always select an organic, extra-virgin, cold-pressed oil.<br /><br />I'm pleased that this Nutiva Organic Extra-Virgin Coconut Oil provides these qualities along with an easy-to-find \"packed on\" and \"best before\" date. The jars I ordered in late January 2011 were packed on September 13, 2010, and the \"best before\" date is September 13, 2012. Stored correctly (cool, dark location, no refrigeration needed), this nutrient-dense oil stays fresh for two years. It smells and tastes great--coconutty and slightly sweet.<br /><br />According to Nutiva, no hexane is used in the processing of this oil. Hexane is a petroleum-derived solvent used in all kinds of industrial applications, from shoe manufacturing to roofing. Interestingly, because hexane's primary molecular structure is carbon, it can be passed off as \"organic.\" Do a little research; \"cold-pressed,\" \"organic,\" AND \"hexane-free\" are key considerations when selecting your coconut oil for nutrition purposes.<br /><br />I'm not as pleased with the plastic jars. In fact, I took off a star as a result of the plastic packaging. I feel that a quality organic oil should be stored in a glass jar, and ideally a dark one to reduce oxidation. I've actually selected coconut oils specifically because they come in glass jars, and might have bypassed this product if I hadn't found it on sale at a good price. I put this information in the review to aid those of you who are looking for a coconut oil in a glass jar."}