{"Id":"343890","ProductId":"P1000-03","UserId":"A1Z3T1I7MCY96N","ProfileName":"Christine Swiridoff","HelpfulnessNumerator":3,"HelpfulnessDenominator":4,"Score":5,"Time":"1232668800","Summary":"Fantastic product and price","text":"This makes the best oatmeal, full of flavor and nutrients. Steel cut oatmeal is not for everyone, including those in my family who are fans of Cream of Wheat. But for those who like to have something with texture, McCann's is excellent: nutty, slightly chewy, and filling enough for a real breakfast that will carry one through to lunch.<br /><br />The cooking time is longer than more processed oats, but those are, well, processed, lacking the nutrition, texture, and flavor of steel cut oats. Others have posted their favorite cooking methods, so one can see that there are several ways to make this faster. I make up a whole batch, which makes four cups, eat one serving fresh and store the rest in the frig. All it takes is 90 seconds in the microwave with a little soy milk, or whatever you prefer, and it's hot and creamy for the fastest breakfast. Great with no sweetener or with one's favorite (brown sugar, real maple syrup, artificial sweetener, honey), with fruit and nuts, with cream, milk, soymilk (in my case), or nothing. It'll stand up to just about anything or, for purists, on its own.<br /><br />I have an Amazon subscription for McCann's steel cut oats, so I've gotten many, many cans of it over the years. A few of them (out of dozens of cans) might have been slightly dented, as a couple of reviewers noted, but only very slightly dented, not more than one might find in the grocery store. The can is solid and has a sealed inner lining, which has always been intact. I've never had one taste stale, as one reviewer mentioned, and I've stocked up on the stuff and had it around for many months. Others have written about the nutritional reasons to go for steel cut oats, and Amazon's prices are great, several dollars cheaper than I can get it in my small town. Plus, it is gluten free, for those with this dietary concern."}