{"Id":"240315","ProductId":"P1000-01","UserId":"A3OJX18B60PJR9","ProfileName":"DAVERAT \"daverat\"","HelpfulnessNumerator":1,"HelpfulnessDenominator":2,"Score":3,"Time":"1348704000","Summary":"Props for improvements but still a lower quality food source for Dogs","text":"Beneful has worked hard to improve their overall ingredient blend since it's debut as a brand but this is still a \"Cheap\" grocery store brand of Dog Food that is Corn-based and whose parent company, Purina/Nestle, has been known to source some pet food ingredients from problematic sources such as China where there is virtually NO oversight.  That said, Dogs do find this food palatable and MY DOG liked it very much but I only allowed him to have a few meals of it by itself.  I tried mixing it into his higher quality meat-based Kibble but then he started to notice the difference and would cleverly pick out only his \"Good\" food kibbles to eat, leabving the Beneful behind.  Smart dog.  Would you like to see a list of the ingredients by weight straight from Beneful's own site?  Here ya go:<br /><br />Ingredients by weight:<br />Ground yellow corn, chicken by-product meal, corn gluten meal, whole wheat flour, animal fat preserved with mixed-tocopherols (form of Vitamin E), rice flour, beef, soy flour, water, meat and bone meal, propylene glycol, sugar, tricalcium phosphate, phosphoric acid, salt, animal digest, potassium chloride, sorbic acid (a preservative), dried peas, dried carrots, calcium propionate (a preservative), choline chloride, l-Lysine monohydrochloride, Vitamin E supplement, zinc sulfate, red 40, ferrous sulfate, manganese sulfate, niacin, yellow 6, yellow 5, Vitamin A supplement, blue 2, calcium carbonate, copper sulfate, Vitamin B-12 supplement, brewers dried yeast, calcium pantothenate, thiamine mononitrate, garlic oil, pyridoxine hydrochloride, riboflavin supplement, Vitamin D-3 supplement, menadione sodium bisulfite complex (source of Vitamin K activity), calcium iodate, folic acid, biotin, sodium selenite.<br /><br />Now, looking at this list, I do notice some improvements and so I want to at least acknowledge that they are TRYING to make a better \"budget\" dog food.  The only problem with that is that Corn allergies and Corn-based diets are not natural for dogs and have been linked to any number of diseases but most comellingly to Canine Epilepsy, something I have personal experience with.  I can tell you honestly that it is far better to ante up for a Meat protein kibble all of your dogs life than to \"save\" money by feeding him or her Corn based kibble until they develop Canine Epilepsy.  If they do, you are in for a world of hurt in your pocketbook and wtaching your best buddy suffer through seizures and the side effects of the seizure meds it's just not worth that $5  to $8 less a bag.  Also, as I mentioned in another review, there's the idea of \"False Economy\" involved.  If you buy a higher quality kibble, you need to feed less of it to Doggie who digests it more completely and benefits from it with better health and fewer dental issues.<br /><br />I don't want to send Beneful the wrong message by giving them 1 star because they HAVE improved their overall mix of ingreidents a great deal since they first came out.  I would suggest that they may still be able to  make further improvements without raising the price a great deal more.  If they were willing to charge a dollar or two more per bag, they could use more quality protein sources and less grain based fillers.  I know some people will buy this no matter what.  I have a friend who showed me a comparison of the protein perecentages that showed beneful was \"comperable\" to a brand I once used.  However, it is the QUALITY and SOURCE of the protein that matters.  Corn Gluten provides protein as do ground up waste parts from chicken factory farming but is that good for Doggie over the course of his life?  No.  Not really.<br /><br />For those wondering what I did with the rest of the bag, I donated it to a shelter that mixed it in with higher quality canned food and they were glad to have it.  I'll still keep hoping that Purina/Nestle gets it right and I will try them again in the future  but right now, I'm awake to the False Economy of paying less now only to pay high Vet Bills in the end."}