{"Id":"343814","ProductId":"P1000-03","UserId":"AYLG72UM74PDE","ProfileName":"D. Press-Dawson","HelpfulnessNumerator":2,"HelpfulnessDenominator":2,"Score":5,"Time":"1201478400","Summary":"Great Oatmeal","text":"I have been eating oatmeal on and off for the last ten years and recently I have found myself enjoying a nice hot bowl for breakfast, especially because its winter. I was first introduced to John McCann's Oatmeal when I decided to quit eating rolled oats because of their texture and the inspiration of watching the episode of \"GOOD EATS\" featuring steel cut or pinhead or Irish oats. I originally found these oats at my local market and found them to be delicious, although, they do take awhile to properly cook they are by far the best option in terms of flavor, nutrition and texture. Their flavor is similar to brown rice while still having a bit of a \"wheaty\" taste. They are very nutritious, but as most nutritious foods are, they must be portioned because of their high calorie content, (I find that half a cup, 300 calories, is the perfect amount) although they are very good for fighting cholesterol and the fat they contain is \"good\" fat. Their texture is also similar to brown rice, but softer and creamier if prepared in such a fashion. I make my oats two ways, on the weekdays I make them in a rice cooker overnight which produces a piping hot bowl of deliciousness and on the weekends I take my time and prepare them on the stove top. They really are a delicious way to start my day and I look forward to enjoying a bowl every morning. Being that I eat pinhead oats everyday I found that buying these tins was beginning to get quite expensive, so one day I went to a bulk foods market and bought a pound of bulk steel cut oats thinking they would be a lower quality and good for the weekdays. Since then I have done numerous side-by-side comparisons of the two and they are exactly the same in taste and texture, making paying double for John McCann's Oats a delicious, but obsolete choice nonetheless.<br /><br />Pros: Delicious, nutritious, and the tin is re usable.<br />Cons: Somewhat expensive when compared to bulk options.<br />Overall: Buy these if you aren't going to be eating them everyday; they are delicious and well worth the money.<br /><br />I cook my steel cut oats on the stove top thusly:<br />1/2 cup steel cut oats<br />1 tbsp unsalted butter<br />2 cup water (boiling)<br />1/2 cup milk<br />1 pinch of kosher salt<br />2 tsp sweetener (brown sugar, honey, or maple syrup)<br /><br />Take a 12\" sauce pan (or something comparable) with a lid and turn heat to medium, add butter, let melt and add oats. The idea here is to roast the oats. Be sure to shake the pan around every minute or so to keep the oats from burning. After about three to four minutes or until the oats smell toasty add the boiling water and drop the heat to low and cover. Let sit for thirty minutes and slowly stir the oats every five minutes until done. After thirty minutes has elapsed add milk, salt and sweetener stir until combined (If a more creamy mixture is desired add more milk or cream to oats). Serve hot and enjoy."}